tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "sdkman/tap"
brew "awscli-local"
brew "caddy"
brew "copilot"
brew "docker"
brew "gh"
brew "git-lfs"
brew "mas"
brew "maven"
brew "node"
brew "podman"
brew "terraform"
brew "zplug"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "sdkman/tap/sdkman-cli"
cask "calibre"
cask "firefox"
cask "iterm2"
cask "itsycal"
cask "jetbrains-toolbox"
cask "lm-studio"
cask "orbstack"
cask "raycast"
cask "slack"
cask "spotify"
cask "the-unarchiver"
cask "tor-browser"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
vscode "github.copilot"
vscode "github.copilot-chat"
brew "uv"
cask "caffeine"
cask "google-chrome"
mas "Okta Verify", id: 490179405