tap "gcenx/wine"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "int128/kubelogin"
# Official Amazon AWS command-line interface
brew "awscli"
# Pack, ship and run any application as a lightweight container
brew "docker"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# Configurable static site generator
brew "hugo"
# Development kit for the Java programming language
brew "openjdk"
# Load testing and performance measurement application
brew "jmeter"
# Lazier way to manage everything docker
brew "lazydocker"
# Java-based project management
brew "maven"
# Platform built on V8 to build network applications
brew "node"
# Open client for Cisco AnyConnect VPN
brew "openconnect"
# 📦🚀 Fast, disk space efficient package manager
brew "pnpm"
# Python version management
brew "pyenv"
# Vpnc-script replacement for easy and secure split-tunnel VPN setup
brew "vpn-slice"
# JavaScript package manager
brew "yarn"
# Incremental, journaling command-line archiver
brew "zpaq"
# Terraform
brew "hashicorp/tap/terraform"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# A kubectl plugin for Kubernetes OpenID Connect authentication
brew "int128/kubelogin/kubelogin"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "firefox"
# Minimal installer for conda specific to conda-forge
cask "miniforge"
# Collaboration platform for API development
cask "postman"
# IDE for Python programming - Community Edition
cask "pycharm-ce"
# Automatically mutes ads on Spotify (not supported)
cask "spotifree"
# Music streaming service
cask "spotify"
# Porting tool, to make Windows programs/games into native apps
cask "unofficial-wineskin"
# VideoLAN Client
cask "vlc"
# Google Chrome (Web browser)
cask "google-chrome"
# Microsoft Edge
cask "microsoft-edge"
# Microsoft Teams (Communication app)
cask "microsoft-teams"
# Flycut (Clipboard manager)
cask "flycut"
# iTerm2 (Terminal app)
cask "iterm2"
# Visual Studio Code (Code editor)
cask "visual-studio-code"
# Slack (Communication app)
cask "slack"
# Itsycal (Calendar app)
cask "itsycal"
# unarchiver (Extracts all types of archives)
cask "the-unarchiver"
# Transmission (Torrent client)
cask "transmission"
# Calibre (Ebook reader)
cask "calibre"
# Fig  (Terminal app)
cask "fig"
# Figma (Design tool)
cask "figma"
# Brave Browser (Privacy focused browser)
cask "brave-browser"
# Jetbrains Toolbox (Manage all jetbrains apps)
cask jetbrains-toolbox
# Obsidian (Note taking app)
cask obsidian
# Shortcat (Keyboard productivity app)
brew shortcat
# Github action on your local machine
brew act
