tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "sdkman/tap"
brew "docker"
brew "gh"
brew "git-lfs"
brew "mas"
brew "maven"
brew "node"
brew "podman"
brew "pyenv"
brew "zplug"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "sdkman/tap/sdkman-cli"
cask "brave-browser"
cask "firefox"
cask "flycut"
cask "iterm2"
cask "itsycal"
cask "jetbrains-toolbox"
cask "lm-studio"
cask "orbstack"
cask "raycast"
cask "slack"
cask "spotifree"
cask "spotify"
cask "the-unarchiver"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "github.copilot"
vscode "github.copilot-chat"
